Argix10.IT/Argix10.WebSvc.Web/SOAPEnvelopes.txt

<AddressValidateRequest%20USERID='019ARGIX2902'>
	<Address ID='0'>
		<Address1>23 Edgewood Road</Address1>
		<Address2></Address2>
		<City>Matawan</City>
		<State>NJ</State>
		<Zip5>07747</Zip5>
		<Zip4></Zip4>
	</Address>
</AddressValidateRequest>

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<SoapCredential xmlns="https://www.argixdirect.com/Tracking/">
			<UserName>bnwsuser</UserName>
			<Password>bn2004</Password>
		</SoapCredential>
	</soap:Header>
	<soap:Body>
		<TrackCarton xmlns="https://www.argixdirect.com/Tracking/">
			<cartonNumber>00417090113473083940</cartonNumber>
		</TrackCarton>
	</soap:Body>
</soap:Envelope>

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Header>
    <SoapCredential xmlns="https://www.argixdirect.com/Tracking/">
      <UserName>bnwsuser</UserName>
      <Password>bn2004</Password>
    </SoapCredential>
  </soap12:Header>
  <soap12:Body>
    <TrackCarton xmlns="https://www.argixdirect.com/Tracking/">
      <cartonNumber>00417090113473083940</cartonNumber>
    </TrackCarton>
  </soap12:Body>
</soap12:Envelope>

<SoapCredential xmlns='https://www.argixdirect.com/Tracking/'><UserName>bnwsuser</UserName><Password>bn2004</Password></SoapCredential>
<TrackCarton xmlns='https://www.argixdirect.com/Tracking/'><cartonNumber>00417090113473083940</cartonNumber></TrackCarton>

<SoapCredential><UserName>bnwsuser</UserName><Password>bn2004</Password></SoapCredential>
<TrackCarton><cartonNumber>00417090113473083940</cartonNumber></TrackCarton>
